04_OpenFoam/_ref/OpenFOAM-14/compressibleVoF/depthCharge2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField
{
    type        surfaces;

    defaultValue 1e5;

    surfaces
    {
        bubble
        {
            type        cylinder;

            point1      (0.5 0.5 -1);
            point2      (0.5 0.5 1);
            radius      0.1;

            value       1e6;
        }
    }
}

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 1e5;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
